IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCAN1_CFG_MCAN1_CFG.xml
<module name="MCAN1_CFG_MCAN1_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MCAN1_CFG_SS_PID" acronym="MCAN1_CFG_SS_PID" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x2272" description="Module ID" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x11" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x1" description="Minor revision" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN1_CFG_SS_CTRL" acronym="MCAN1_CFG_SS_CTRL" offset="0x4" width="32" description="">
		<bitfield id="EXT_TS_CNTR_EN" width="1" begin="6" end="6" resetval="0x0" description="External TimeStamp Counter Enable" range="6" rwaccess="RW"/> 
		<bitfield id="AUTOWAKEUP" width="1" begin="5" end="5" resetval="0x0" description="Automatic Wakeup Enable" range="5" rwaccess="RW"/> 
		<bitfield id="WAKEUPREGEN" width="1" begin="4" end="4" resetval="0x0" description="Wakeup Request Enable" range="4" rwaccess="RW"/> 
		<bitfield id="DBGSUSP_FREE" width="1" begin="3" end="3" resetval="0x1" description="0-Honor Debug Suspend, 1-Disregard debug suspend" range="3" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_SS_STAT" acronym="MCAN1_CFG_SS_STAT" offset="0x8" width="32" description="">
		<bitfield id="EN_FDOE" width="1" begin="2" end="2" resetval="0x1" description="Reflects the value of mcanss_enable_fdoe configuration portx=mcanss_enable_fdoe" range="2" rwaccess="RO"/> 
		<bitfield id="MMI_DONE" width="1" begin="1" end="1" resetval="0x1" description="0:Memory Initialization is in progress, 1:Memory Intialization Done" range="1" rwaccess="RO"/>
	</register>
	<register id="MCAN1_CFG_SS_ICS" acronym="MCAN1_CFG_SS_ICS" offset="0xC" width="32" description="">
		<bitfield id="ICS" width="1" begin="0" end="0" resetval="0x0" description="This bit contains the External TimeStamp Counter Overflow Interrupt status. Write '1' to clear bits. (ICS - Interrupt Clear Shadow Register)" range="0" rwaccess="WO"/>
	</register>
	<register id="MCAN1_CFG_SS_IRS" acronym="MCAN1_CFG_SS_IRS" offset="0x10" width="32" description="">
		<bitfield id="IRS" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt status. Read raw interrupt status. (IRS - Interrupt Raw Status Register)" range="0" rwaccess="RO"/>
	</register>
	<register id="MCAN1_CFG_SS_IECS" acronym="MCAN1_CFG_SS_IECS" offset="0x14" width="32" description="">
		<bitfield id="IECS" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt. Write '1' to clear bits. (IECS - Interrupt Enable Clear Shadow Register)" range="0" rwaccess="WO"/>
	</register>
	<register id="MCAN1_CFG_SS_IE" acronym="MCAN1_CFG_SS_IE" offset="0x18" width="32" description="">
		<bitfield id="IE" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt. Write '1' to set interrupt enable. Read returns interrupt enable. (IE - Interrupt Enable Register)" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_SS_IES" acronym="MCAN1_CFG_SS_IES" offset="0x1C" width="32" description="">
		<bitfield id="IES" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt. Read Enabled Interrupts. (IES - Interrupt Enable Status)" range="0" rwaccess="RO"/>
	</register>
	<register id="MCAN1_CFG_SS_EOI" acronym="MCAN1_CFG_SS_EOI" offset="0x20" width="32" description="">
		<bitfield id="EOI" width="8" begin="7" end="0" resetval="0x0" description="Write with bit position of targeted interrupt. (E.g. Ext TS is bit 0).Upon write, level interrupt will clear and if unserviced interrupt counter > 1 will issue another pulse interrupt. Field values:  ext_ts_eoi(0): EOI value for External TS interrupt  mcan_0_eoi(1): EOI value for mcan[0] interrupt  mcan_1_eoi(2): EOI value for mcan[1] interrupt(EOI - End Of Interrupt)" range="7 - 0" rwaccess="WO"/>
	</register>
	<register id="MCAN1_CFG_SS_EXT_TS_PS" acronym="MCAN1_CFG_SS_EXT_TS_PS" offset="0x24" width="32" description="">
		<bitfield id="PRESCALE" width="24" begin="23" end="0" resetval="0x0" description="External Timestamp Prescaler reload value.External Timestamp count rate is host clock rate divided by this valuewith one exception: a value of 0 has the same effect as 1 ." range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_SS_EXT_TS_USIC" acronym="MCAN1_CFG_SS_EXT_TS_USIC" offset="0x28" width="32" description="">
		<bitfield id="EXT_TS_INTR_CNTR" width="5" begin="4" end="0" resetval="0x0" description="Number of unserviced rollover interrupts. If >1 an EOI write will issue another pulse interrupt (EXT_TS_USIC - External TImeStamp Unserviced Interrupts Counter)" range="4 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN1_CFG_CREL" acronym="MCAN1_CFG_CREL" offset="0x200" width="32" description="">
		<bitfield id="REL" width="4" begin="31" end="28" resetval="0x3" description="Core Release" range="31 - 28" rwaccess="RO"/> 
		<bitfield id="STEP" width="4" begin="27" end="24" resetval="0x2" description="Step of Core Release" range="27 - 24" rwaccess="RO"/> 
		<bitfield id="SUBSTEP" width="4" begin="23" end="20" resetval="0x3" description="Sub-Step of Core Release" range="23 - 20" rwaccess="RO"/> 
		<bitfield id="YEAR" width="4" begin="19" end="16" resetval="0x8" description="Time Stamp Year" range="19 - 16" rwaccess="RO"/> 
		<bitfield id="MON" width="8" begin="15" end="8" resetval="0x6" description="Time Stamp Month" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="DAY" width="8" begin="7" end="0" resetval="0x8" description="Time Stamp Day" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN1_CFG_ENDN" acronym="MCAN1_CFG_ENDN" offset="0x204" width="32" description="">
		<bitfield id="ETV" width="32" begin="31" end="0" resetval="0x2271560481" description="Endianess test value" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN1_CFG_CUST" acronym="MCAN1_CFG_CUST" offset="0x208" width="32" description="">
		<bitfield id="CUST" width="32" begin="31" end="0" resetval="0x0" description="Custom" range="31 - 0" rwaccess="RO"/>
	</register>
