IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCAN1_CFG_MCAN1_CFG.xml
	<register id="MCAN1_CFG_DBTP" acronym="MCAN1_CFG_DBTP" offset="0x20C" width="32" description="">
		<bitfield id="TDC" width="1" begin="23" end="23" resetval="0x0" description="Transmitter Delay Compensation" range="23" rwaccess="RW"/> 
		<bitfield id="DBRP" width="5" begin="20" end="16" resetval="0x0" description="Data Baud Rate Prescaler" range="20 - 16" rwaccess="RW"/> 
		<bitfield id="DTSEG1" width="5" begin="12" end="8" resetval="0x10" description="Data time segment before smaple point" range="12 - 8" rwaccess="RW"/> 
		<bitfield id="DTSEG2" width="4" begin="7" end="4" resetval="0x3" description="Data time segment after sample point" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="DSJW" width="4" begin="3" end="0" resetval="0x3" description="Data resynchronization Jump Width" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_TEST" acronym="MCAN1_CFG_TEST" offset="0x210" width="32" description="">
		<bitfield id="RX" width="1" begin="7" end="7" resetval="0x0" description="Receive Pin" range="7" rwaccess="RO"/> 
		<bitfield id="TX" width="2" begin="6" end="5" resetval="0x0" description="Control of Transmit Pin" range="6 - 5" rwaccess="RW"/> 
		<bitfield id="LBCK" width="1" begin="4" end="4" resetval="0x0" description="Loop Back Mode" range="4" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_RWD" acronym="MCAN1_CFG_RWD" offset="0x214" width="32" description="">
		<bitfield id="WDV" width="8" begin="15" end="8" resetval="0x0" description="Watchdog Value" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="WDC" width="8" begin="7" end="0" resetval="0x0" description="Watchdog Counter Value" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_CCCR" acronym="MCAN1_CFG_CCCR" offset="0x218" width="32" description="">
		<bitfield id="TXP" width="1" begin="14" end="14" resetval="0x0" description="Transmit Pause" range="14" rwaccess="RW"/> 
		<bitfield id="EFBI" width="1" begin="13" end="13" resetval="0x0" description="Edge Filtering durign Bus Integration" range="13" rwaccess="RW"/> 
		<bitfield id="PXHD" width="1" begin="12" end="12" resetval="0x0" description="Protocol Exception Handling Disable" range="12" rwaccess="RW"/> 
		<bitfield id="BRSE" width="1" begin="9" end="9" resetval="0x0" description="Bit Rate Switch Enable" range="9" rwaccess="RW"/> 
		<bitfield id="FDOE" width="1" begin="8" end="8" resetval="0x0" description="FD Operation Enable" range="8" rwaccess="RW"/> 
		<bitfield id="TEST" width="1" begin="7" end="7" resetval="0x0" description="Test Mode enable" range="7" rwaccess="RW"/> 
		<bitfield id="DAR" width="1" begin="6" end="6" resetval="0x0" description="Disable Automatic Regransmission" range="6" rwaccess="RW"/> 
		<bitfield id="MON" width="1" begin="5" end="5" resetval="0x0" description="Bus Monitoring Mode" range="5" rwaccess="RW"/> 
		<bitfield id="CSR" width="1" begin="4" end="4" resetval="0x0" description="Clock Stop Request" range="4" rwaccess="RW"/> 
		<bitfield id="CSA" width="1" begin="3" end="3" resetval="0x0" description="Clock Stop Acknowledge" range="3" rwaccess="RO"/> 
		<bitfield id="ASM" width="1" begin="2" end="2" resetval="0x0" description="Restriced Operation Mode" range="2" rwaccess="RW"/> 
		<bitfield id="CCE" width="1" begin="1" end="1" resetval="0x0" description="Configuration Change Enable" range="1" rwaccess="RW"/> 
		<bitfield id="INIT" width="1" begin="0" end="0" resetval="0x1" description="Initialization" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_NBTP" acronym="MCAN1_CFG_NBTP" offset="0x21C" width="32" description="">
		<bitfield id="NSJW" width="7" begin="31" end="25" resetval="0x3" description="Nominal Resynchronization Jump Width" range="31 - 25" rwaccess="RW"/> 
		<bitfield id="NBRP" width="9" begin="24" end="16" resetval="0x0" description="Nominal Baud Rate Prescaler" range="24 - 16" rwaccess="RW"/> 
		<bitfield id="NTSEG1" width="8" begin="15" end="8" resetval="0x10" description="Nominal Time segment before sample point" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="NTSEG2" width="7" begin="6" end="0" resetval="0x3" description="Nominal Time segment after sample point" range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_TSCC" acronym="MCAN1_CFG_TSCC" offset="0x220" width="32" description="">
		<bitfield id="TCP" width="4" begin="19" end="16" resetval="0x0" description="Timestamp Counter Prescaler" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="TSS" width="2" begin="1" end="0" resetval="0x0" description="Timestamp Select" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_TSCV" acronym="MCAN1_CFG_TSCV" offset="0x224" width="32" description="">
		<bitfield id="TSC" width="16" begin="15" end="0" resetval="0x0" description="Timestamp Counter" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_TOCC" acronym="MCAN1_CFG_TOCC" offset="0x228" width="32" description="">
		<bitfield id="TOP" width="16" begin="31" end="16" resetval="0x65535" description="Timeout Period" range="31 - 16" rwaccess="RW"/> 
		<bitfield id="TOS" width="2" begin="2" end="1" resetval="0x0" description="Timeout Select" range="2 - 1" rwaccess="RW"/> 
		<bitfield id="ETOC" width="1" begin="0" end="0" resetval="0x0" description="Enable Timeout Counter" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_TOCV" acronym="MCAN1_CFG_TOCV" offset="0x22C" width="32" description="">
		<bitfield id="TOC" width="16" begin="15" end="0" resetval="0x65535" description="Timeout Counter" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_RES00" acronym="MCAN1_CFG_RES00" offset="0x230" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES01" acronym="MCAN1_CFG_RES01" offset="0x234" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES02" acronym="MCAN1_CFG_RES02" offset="0x238" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES03" acronym="MCAN1_CFG_RES03" offset="0x23C" width="32" description="">
		
	</register>
