IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCAN1_CFG_MCAN1_CFG.xml
	<register id="MCAN1_CFG_ILS" acronym="MCAN1_CFG_ILS" offset="0x258" width="32" description="">
		<bitfield id="ARAL" width="1" begin="29" end="29" resetval="0x0" description="Accees to Reserve Address Interrupt Line" range="29" rwaccess="RW"/> 
		<bitfield id="PEDL" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in Data Phase Interrupt Line" range="28" rwaccess="RW"/> 
		<bitfield id="PEAL" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase Interrupt Line" range="27" rwaccess="RW"/> 
		<bitfield id="WDIL" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt Line" range="26" rwaccess="RW"/> 
		<bitfield id="BOL" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status Interrupt Line" range="25" rwaccess="RW"/> 
		<bitfield id="EWL" width="1" begin="24" end="24" resetval="0x0" description="Warning Status Interrupt Line" range="24" rwaccess="RW"/> 
		<bitfield id="EPL" width="1" begin="23" end="23" resetval="0x0" description="Error Passive Interrupt Line" range="23" rwaccess="RW"/> 
		<bitfield id="ELOL" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow Interrupt Line" range="22" rwaccess="RW"/> 
		<bitfield id="BEUL" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected Interrupt Line" range="21" rwaccess="RW"/> 
		<bitfield id="BECL" width="1" begin="20" end="20" resetval="0x0" description="Bit Error Corrected Interrupt Line" range="20" rwaccess="RW"/> 
		<bitfield id="DRXL" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer Interrupt Line" range="19" rwaccess="RW"/> 
		<bitfield id="TOOL" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred Interrupt Line" range="18" rwaccess="RW"/> 
		<bitfield id="MRAFL" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure Interrupt Line" range="17" rwaccess="RW"/> 
		<bitfield id="TSWL" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound Interrupt Line" range="16" rwaccess="RW"/> 
		<bitfield id="TEFLL" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Event Lost Interrupt Line" range="15" rwaccess="RW"/> 
		<bitfield id="TEFFL" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full Interrupt Line" range="14" rwaccess="RW"/> 
		<bitfield id="TEFWL" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached Interrupt Line" range="13" rwaccess="RW"/> 
		<bitfield id="TEFNL" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry Interrupt Line" range="12" rwaccess="RW"/> 
		<bitfield id="TFEL" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty Interrupt Line" range="11" rwaccess="RW"/> 
		<bitfield id="TCFL" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finishied Interrupt Line" range="10" rwaccess="RW"/> 
		<bitfield id="TCL" width="1" begin="9" end="9" resetval="0x0" description="Transmission Completed Interrupt Line" range="9" rwaccess="RW"/> 
		<bitfield id="HPML" width="1" begin="8" end="8" resetval="0x0" description="High Priority message Interrupt Line" range="8" rwaccess="RW"/> 
		<bitfield id="RF1LL" width="1" begin="7" end="7" resetval="0x0" description="rx FIFO 1 Message Lost Interrupt Line" range="7" rwaccess="RW"/> 
		<bitfield id="RF1FL" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full Interrupt Line" range="6" rwaccess="RW"/> 
		<bitfield id="RF1WL" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached Interrupt Line" range="5" rwaccess="RW"/> 
		<bitfield id="RF1NL" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message Interrupt Line" range="4" rwaccess="RW"/> 
		<bitfield id="RF0LL" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost Interrupt Line" range="3" rwaccess="RW"/> 
		<bitfield id="RF0FL" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full Interrupt Line" range="2" rwaccess="RW"/> 
		<bitfield id="RF0WL" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached Interrupt Line" range="1" rwaccess="RW"/> 
		<bitfield id="RF0NL" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message Interrupt Line" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_ILE" acronym="MCAN1_CFG_ILE" offset="0x25C" width="32" description="">
		<bitfield id="EINT1" width="1" begin="1" end="1" resetval="0x0" description="Enable Interrupt Line 1" range="1" rwaccess="RW"/> 
		<bitfield id="EINT0" width="1" begin="0" end="0" resetval="0x0" description="Enable Interrupt Line 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN1_CFG_RES05" acronym="MCAN1_CFG_RES05" offset="0x260" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES06" acronym="MCAN1_CFG_RES06" offset="0x264" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES07" acronym="MCAN1_CFG_RES07" offset="0x268" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES08" acronym="MCAN1_CFG_RES08" offset="0x26C" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES09" acronym="MCAN1_CFG_RES09" offset="0x270" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES10" acronym="MCAN1_CFG_RES10" offset="0x274" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES11" acronym="MCAN1_CFG_RES11" offset="0x278" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_RES12" acronym="MCAN1_CFG_RES12" offset="0x27C" width="32" description="">
		
	</register>
	<register id="MCAN1_CFG_GFC" acronym="MCAN1_CFG_GFC" offset="0x280" width="32" description="">
		<bitfield id="ANFS" width="2" begin="5" end="4" resetval="0x0" description="Accept Non-matching Frames Standard" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="ANFE" width="2" begin="3" end="2" resetval="0x0" description="Accept Non-matching Frames Extended" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="RRFS" width="1" begin="1" end="1" resetval="0x0" description="reject Remote Frames Standard" range="1" rwaccess="RW"/> 
		<bitfield id="RRFE" width="1" begin="0" end="0" resetval="0x0" description="reject Remote Frames Extended" range="0" rwaccess="RW"/>
	</register>
